{
    "projects":
    [
        {
            project: "LeadYouth",
            imgSrc: "media/leadyouth.png",
            imgAlt: "LeadYouth company logo",
            description: "At LeadYouth, I will be developing an AI-driven mobile app aimed at enhancing leadership training for youth. This project involves integrating AI models to support features such as personality development, leadership simulations, and speech training. Over four months, I will design, develop, and test the app, ensuring it aligns with LeadYouth’s mission.",
            link: "https://www.leadyouth.org/"
        },
        {
            project: "Tag-N-Trac",
            imgSrc: "media/tagntrac.png",
            imgAlt: "Tag-N-Trac company logo",
            description: "At Tag-N-Trac, I developed an AI assistant using OpenAI's Assistant API to enable natural language queries on the company dashboard. This improved user experience by making data retrieval and analysis more intuitive. I also integrated backend systems with API endpoints to track asset lifecycles, retrieve sensor data, manage alerts, and generate reports, streamlining logistics and monitoring processes.",
            link: "https://tagntrac.ai/"
        },
        {
            project: "Hermes Epitek",
            imgSrc: "media/hermes.png",
            imgAlt: "Hermes Epitek company logo",
            description: "I built a dynamic web application that visualized historical factory alarm data using JavaScript, Chart.js, and MySQL, enabling users to analyze trends through interactive graphs. By implementing API integration, I optimized data filtering and extraction, improving the accuracy and accessibility of operational insights for manufacturing decision-making.",
            link: "https://www.hermes.com.tw/en/"
        },
        {
            project: "ERSP Software Researcher",
            imgSrc: "media/ersp.jpeg",
            imgAlt: "ERSP program research project logo",
            description: "I worked on Proofessor, an AI tutor leveraging GPT-4 to assist students in writing mathematical proofs. Using Python, prompt engineering, and OpenAI’s API, I designed interactive tutoring sessions that provided structured feedback. Additionally, I integrated Lean 4 for auto-formalization, enhancing proof validation and student learning outcomes.",
            link: "https://ersp.ucsd.edu/"
        },
        {
            project: "Computer Science Tutor",
            imgSrc: "media/tutor.png",
            imgAlt: "UCSD Computer Science tutoring icon",
            description: "I led lab sessions for 80 students in CSE 15L (Software Tools & Techniques Lab), teaching Linux OS, Vim, shell scripting, JUnit testing, and Git version control. I provided hands-on guidance, helping students build foundational software development skills.",
            link: "https://cse.ucsd.edu/"
        }
    ]
}